딕셔너리 - key와 시리즈의 index

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
b={'a':4,'b':2,'c':3}

In [7]:
pd.Series(data=b)

a    4
b    2
c    3
dtype: int64

In [8]:
pd.Series(data=b, index=['b','c','a'])

b    2
c    3
a    4
dtype: int64

In [9]:
b

{'a': 4, 'b': 2, 'c': 3}

In [10]:
y= pd.Series(data=b, index=['b','c','a','e'])

In [11]:
y

b    2.0
c    3.0
a    4.0
e    NaN
dtype: float64

#### NaN (:Not a Number) missing data를 의미

In [12]:
pd.Series(data=b, index=['b','c','a'], dtype=float)

b    2.0
c    3.0
a    4.0
dtype: float64

In [13]:
pd.Series(data=y, index=['b','c','a','e'], dtype=int) ##int로 변경할수없는 nan값이 있기때문에 변경X

b    2.0
c    3.0
a    4.0
e    NaN
dtype: float64

In [14]:
#정수 X,  string 가능

In [15]:
yy= pd.Series(data=b, index=['b','c','a'], name='dictlab') ##data set 자체의 별도 이름을 추가 가능
yy

b    2
c    3
a    4
Name: dictlab, dtype: int64

In [16]:
y.index.name= 'labdict'
y

labdict
b    2.0
c    3.0
a    4.0
e    NaN
dtype: float64

## DataFrame 만들기
#### pd.DataFrame(data=, index=, columns=)

*list를 이용한 dataframe 만들기

In [17]:
h = [1.0,2.0,3.0,4.0]
i = [4.0,3.0,2.0,1.0]
j = [5.0,6.0,7.0,8.0]
k = [8.0,7.0,6.0,5.0]

In [18]:
pd.DataFrame(data=[h,i,j,k])

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  4.0  3.0  2.0  1.0
2  5.0  6.0  7.0  8.0
3  8.0  7.0  6.0  5.0

In [19]:
pd.DataFrame(data=[h,i,j,k],
             index=['1st','2nd','3rd','4th'])

       0    1    2    3
1st  1.0  2.0  3.0  4.0
2nd  4.0  3.0  2.0  1.0
3rd  5.0  6.0  7.0  8.0
4th  8.0  7.0  6.0  5.0

In [20]:
pd.DataFrame(data=[h,i,j,k],
             index=['1st','2nd','3rd','4th'],
             columns=['one','two','three','four'])

     one  two  three  four
1st  1.0  2.0    3.0   4.0
2nd  4.0  3.0    2.0   1.0
3rd  5.0  6.0    7.0   8.0
4th  8.0  7.0    6.0   5.0

리스트를 하나의 변수로 대입하기

In [21]:
h = [1.0,2.0,3.0,4.0]
i = [4.0,3.0,2.0,1.0]
j = [5.0,6.0,7.0,8.0]
k = [8.0,7.0,6.0,5.0]

In [22]:
e = [[1.0,2.0,3.0,4.0],
     [4.0,3.0,2.0,1.0],
     [5.0,6.0,7.0,8.0],
     [8.0,7.0,6.0,5.0]]

In [23]:
pd.DataFrame(data=e)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  4.0  3.0  2.0  1.0
2  5.0  6.0  7.0  8.0
3  8.0  7.0  6.0  5.0

In [24]:
pd.DataFrame(e, 
            index=['1st','2nd','3rd','4th'],
            columns=['one','two','three','four'])

     one  two  three  four
1st  1.0  2.0    3.0   4.0
2nd  4.0  3.0    2.0   1.0
3rd  5.0  6.0    7.0   8.0
4th  8.0  7.0    6.0   5.0

In [25]:
a = {'one': [1.0,2.0,3.0,4.0],
     'two':  [4.0,3.0,2.0,1.0],
     'three':[5.0,6.0,7.0,8.0],
     'four': [8.0,7.0,6.0,5.0]}

In [26]:
pd.DataFrame(a)

   one  two  three  four
0  1.0  4.0    5.0   8.0
1  2.0  3.0    6.0   7.0
2  3.0  2.0    7.0   6.0
3  4.0  1.0    8.0   5.0

In [27]:
pd.DataFrame(a,index=['1st','2nd','3rd','4th'])

     one  two  three  four
1st  1.0  4.0    5.0   8.0
2nd  2.0  3.0    6.0   7.0
3rd  3.0  2.0    7.0   6.0
4th  4.0  1.0    8.0   5.0

In [28]:
pd.DataFrame(a,index=['1st','2nd','3rd','4th'],
               columns=['one','three','two','four'])

     one  three  two  four
1st  1.0    5.0  4.0   8.0
2nd  2.0    6.0  3.0   7.0
3rd  3.0    7.0  2.0   6.0
4th  4.0    8.0  1.0   5.0

columns 에서 언급한 순서대로 열을 나열하게 된다

In [38]:
pd.DataFrame(a,index=['1st','2nd','3rd','4th'])

     one  two  three  four
1st  1.0  4.0    5.0   8.0
2nd  2.0  3.0    6.0   7.0
3rd  3.0  2.0    7.0   6.0
4th  4.0  1.0    8.0   5.0

또한 columns에서 언급한 것만 표현하게 할 수 있다

In [40]:
pd.DataFrame(a,index=['1st','2nd','3rd','4th'],
               columns = ['four', 'one'])

     four  one
1st   8.0  1.0
2nd   7.0  2.0
3rd   6.0  3.0
4th   5.0  4.0

열에 없는 새로운 이름을 가진 열을 추가하여 입력하면? 에러가 아니라 NaN값으로 나열시킴

In [42]:
pd.DataFrame(a,index=['1st','2nd','3rd','4th'],
               columns = ['four','NEW', 'one'])

     four  NEW  one
1st   8.0  NaN  1.0
2nd   7.0  NaN  2.0
3rd   6.0  NaN  3.0
4th   5.0  NaN  4.0

In [ ]:
a

### 주의 !! DataFrame에서 index 는 개수 다르면 error,
     아예 index를 쓰지 않거나 개수를 맞춰 기입

In [31]:
pd.DataFrame(a,index=['1st','2nd','3rd','4th'],
               columns = ['one', 'TWO', 'three', 'FOUR'])

     one  TWO  three FOUR
1st  1.0  NaN    5.0  NaN
2nd  2.0  NaN    6.0  NaN
3rd  3.0  NaN    7.0  NaN
4th  4.0  NaN    8.0  NaN

 ### 주의!! DataFrame에서 딕셔너리에 없는 columns의 이름을 입력하면 값이 NaN

* dictionary로 데이터프레임 만들기

In [32]:
a = {'one': {'1st':1.0, '2nd':2.0,'3rd':3.0,'4th':4.0},
     'two': {'1st':4.0, '2nd':3.0,'3rd':2.0,'4th':1.0},
     'three': {'1st':5.0, '2nd':6.0,'3rd':7.0,'4th':8.0},
     'four': {'1st':8.0, '2nd':7.0,'3rd':6.0,'4th':5.0} }

In [33]:
aaa= pd.DataFrame(a)

In [34]:
aaa

     one  two  three  four
1st  1.0  4.0    5.0   8.0
2nd  2.0  3.0    6.0   7.0
3rd  3.0  2.0    7.0   6.0
4th  4.0  1.0    8.0   5.0

In [35]:
aaa.T #(행렬전치)

       1st  2nd  3rd  4th
one    1.0  2.0  3.0  4.0
two    4.0  3.0  2.0  1.0
three  5.0  6.0  7.0  8.0
four   8.0  7.0  6.0  5.0